rule credential_dumping_via_ntdsutil {
  meta:
    author = "root_assistant"
    description = "Detects the use of ntdsutil.exe to create an IFM (Install From Media) backup of the Active Directory database, a technique used for offline credential dumping (T1003.003)."
    mitre_attack_tactic = "Credential Access"
    mitre_attack_technique = "OS Credential Dumping: NTDS"
    mitre_attack_technique_id = "T1003.003"
    severity = "CRITICAL"
    priority = "CRITICAL"

  events:
    $process.metadata.event_type = "PROCESS_LAUNCH"
    $process.target.process.file.full_path = /ntdsutil\.exe/ nocase
    // Match on arguments for Install From Media (IFM) creation
    $process.target.process.command_line = /ac i ntds/ nocase
    $process.target.process.command_line = /ifm/ nocase
    $process.target.process.command_line = /create full/ nocase

  condition:
    $process
}
